app/views/venues/show.html.erb


<% @venue.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."venue_id" = ?  [["venue_id", 1]]