app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("description", "stars", "user_id", "venue_id") VALUES (?, ?, ?, ?)  [["description", "Its ok but close early"], ["stars", 2], ["user_id", 1], ["venue_id", 2]]
---
  def create
    @review = Review.new(review_params)
    @review.save