app/controllers/venues_controller.rb

  def index #GET /venues
    @venues = Venue.all
---
SELECT "venues".* FROM "venues"

  def show
    @venue = Venue.find(params[:id])
---
SELECT "venues".* FROM "venues" WHERE "venues"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    #foursquare.find_by_id(para,s[:id])
    @venue = Venue.new(venue_params)
    @venue.creator_user_id = current_user.id
    @venue.save
---
INSERT INTO "venues" ("name") VALUES (?)  [["name", "snice"]]